/**
 * 背包问题
 *
 * 有 n 件物品和一个容量为 v 的背包。第 i 件物品的容量是 c[i]，价值是 w[i]。求解将哪些物品装入背包可使价值总和最大
 */
var c = [1, 2, 3, 4]; // 每件物品的容量
var w = [1, 2, 3, 4]; // 每件物品的价值
var n = c.length;
var v = 8; // 背包容量

// 枚举矩阵
// 0, 0, 0, 0;

// 1, 0, 0, 0;
// 0, 1, 0, 0;
// 0, 0, 1, 0;
// 0, 0, 0, 1;

// 1, 1, 0, 0;
// 1, 0, 1, 0;
// 1, 0, 0, 1;
// 0, 1, 1, 0;
// 0, 1, 0, 1;
// 0, 0, 1, 1;

// 1, 1, 1, 0;
// 1, 1, 0, 1;
// 1, 0, 1, 1;
// 0, 1, 1, 1;

// 1, 1, 1, 1;

function findMaxValueDirect() {
  var d = 0;
  var matrix = [];

  while (d <= n) {
    matrix;
  }
}

function findMaxValue(n, v) {}
